/**
 * Function: 全国高校计算机能力挑战赛区域赛决赛第五题
 * Question：公交车换乘，城市推出了优惠换乘活动，乘客第一次在公交车上打卡后，可以免费同站台换乘两次
 *          现给出城市中多条公交路线，每个公交站有一个编号，编号由一个字母和一位或两位数字组成。
 *          给定某乘客的出发站，问两次换乘，最多可以经过多少个不同的公交站
 * 输入说明：第一行是一个整数N(1<N<=20)和出发站编号，其中N表示公交路线数量。
 *          接下来N行，每行表示一条公交路线的所有停靠站编号(单条线路的停靠站数量少于20)，中间用空格隔开
 *          已知公交线路不会形成环线
 * 输出说明：一个整数，表示不超过两次换乘，最多可以经过多少个不同的公交站
 * SampleIn：3 C3
 *          A1 A2 A3
 *          C1 C2 C3 C4
 *          A2 B1 C2 D1
 * SampleOut：5
 * Ps.这道题没做出来，感觉好像涉及了图的遍历，感觉不难，但是数据结构没学好，图一点不会，于是放弃了。
 */
public class Main5 {

}
